<template>
  <svg
    xmlns="http://www.w3.org/2000/svg"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    width="20"
    height="20"
    viewBox="0 0 20 20"
  >
    <defs>
      <clipPath id="clip-path">
        <rect
          id="矩形_3502"
          data-name="矩形 3502"
          width="20"
          height="20"
          transform="translate(138 159)"
          fill="#fff"
          stroke="#707070"
          stroke-width="1"
        />
      </clipPath>
    </defs>
    <g
      id="蒙版组_295"
      data-name="蒙版组 295"
      transform="translate(-138 -159)"
      clip-path="url(#clip-path)"
    >
      <g id="组_4964" data-name="组 4964" transform="translate(139.188 160.125)">
        <g id="组_4963" data-name="组 4963">
          <path
            id="路径_3309"
            data-name="路径 3309"
            d="M24.514,171.736l1.759.221-.21-1.144-.162-.88C25.442,170.587,24.962,171.2,24.514,171.736Zm-.842.982c-.27.3-.507.54-.685.75l-.389.41-.783.831-.788-.842-.394-.41c-.27-.286-.675-.729-1.144-1.274l-4.161-.54,1.365,4.922h9.86a.475.475,0,0,0,.459-.54l-.54-2.936Zm-1.856-6.028a2.159,2.159,0,1,0-2.159-2.159A2.159,2.159,0,0,0,21.816,166.69Zm0-3.238a1.079,1.079,0,1,1-1.079,1.079A1.079,1.079,0,0,1,21.816,163.452Z"
            transform="translate(-10.009 -159.291)"
            fill="#00f7fa"
            opacity="0.8"
          />
          <path
            id="路径_3313"
            data-name="路径 3313"
            d="M7.624,171.832h0c0-.013-3.238,0-3.238,0a.464.464,0,0,0-.459.389l-.734,3.994,7.4.928a15.761,15.761,0,0,1-2.968-5.31Z"
            transform="translate(-2.099 -165.453)"
            fill="none"
            stroke="#00f7fa"
            stroke-width="1"
          />
          <path
            id="路径_3310"
            data-name="路径 3310"
            d="M346.292,13.848l.394-.416c.507-.54,4.943-5.3,4.943-8.1a5.337,5.337,0,0,0-10.675,0c0,2.785,4.441,7.555,4.949,8.1Zm0-12.763a4.263,4.263,0,0,1,4.258,4.258c0,1.819-2.785,5.283-4.258,6.924-1.473-1.619-4.258-5.105-4.258-6.924a4.263,4.263,0,0,1,4.258-4.258Z"
            transform="translate(-334.485 0)"
            fill="#00f7fa"
          />
          <path
            id="路径_3311"
            data-name="路径 3311"
            d="M.951,187.48l-.9,4.911a.475.475,0,0,0,.47.54h5.1l-1.387-4.943Z"
            transform="translate(-0.05 -175.656)"
            fill="none"
            stroke="#00f7fa"
            stroke-width="1"
          />
          <path
            id="路径_3314"
            data-name="路径 3314"
            d="M.951,187.48l-.9,4.911a.475.475,0,0,0,.47.54h5.1l-1.387-4.943Z"
            transform="translate(-0.05 -175.656)"
            fill="#00f7fa"
            stroke="#00f7fa"
            stroke-width="1"
            opacity="0.2"
          />
        </g>
        <path
          id="路径_3312"
          data-name="路径 3312"
          d="M23.672,190.073c-.27.3-.507.54-.685.75l-.389.41-.783.831-.788-.842-.394-.41c-.27-.286-.675-.729-1.144-1.274L15.329,189l1.365,4.922h9.86a.475.475,0,0,0,.459-.54l-.54-2.936Z"
          transform="translate(-10.009 -176.646)"
          fill="none"
          stroke="#00f7fa"
          stroke-width="1"
        />
      </g>
    </g>
  </svg>
</template>